app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-05-10 23:30:30.044680"], ["updated_at", "2014-05-10 23:30:30.044680"]]