app/controllers/images_controller.rb

SELECT "images".* FROM "images"
---
  def index
    @images = Image.all

SELECT "comments".* FROM "comments"  WHERE "comments"."image_id" = 1
---
  def show
    @comments = Comment.where(:image_id => params[:id])

INSERT INTO "images" ("created_at", "imageUrl", "name", "updated_at", "views") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-05-08 17:00:24.950970"], ["imageUrl", "JES"], ["name", "safaf"], ["updated_at", "2014-05-08 17:00:24.950970"], ["views", 2]]
---
  def create
    @image = Image.new #(image_params)

    #if testing local:
   # @information = Cloudinary::Uploader.upload('/home/joe/bearded-ninja-backend/app/assets/images/kuva4.jpg')

    @information = Cloudinary::Uploader.upload(params[:file])
    ind = 0
    @information.each do |i|
       if ind == 11
           @url = i[1]
       end
    ind = ind + 1
    end
    @image.imageUrl = @url
    begin
       @generatedID = "BN-" + create_10_random_numbers() + @image.id.to_s
    end while Image.where(:generated_id => @generatedID).first != nil
    @image.generated_id = @generatedID
    @image.name = params[:imgName]
    @image.tags = params[:imgTags]
    @image.mature = params[:imgMature]
    @image.views = 0

    respond_to do |format|
      if @image.save

SELECT  "images".* FROM "images"  WHERE "images"."id" = ? LIMIT 1  [["id", 5]]
---
    def set_image
      @image = Image.find(params[:id])