app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?)  [["created_at", "2014-05-11 10:15:25.122309"], ["password_digest", "$2a$10$sK/4o0EipsJbaV9rvAVTm.J0Azn5c5yhZl5bLlDcpIkroq1CSkNHy"], ["updated_at", "2014-05-11 10:15:25.122309"], ["username", "joo"]]