app/views/images/show.json.jbuilder

SELECT "comments".* FROM "comments"  WHERE "comments"."image_id" = 1
SELECT COUNT(*) FROM "comments"  WHERE "comments"."image_id" = 1
---
json.extract! @image, :id, :name, :imageUrl, :views, :created_at, :updated_at
json.comments_amount @comments.size